# MPG Cars

### Step 1. Import the necessary libraries

In [1]:
import pandas as pd

### Step 2. Import the first dataset [cars1](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/05_Merge/Auto_MPG/cars1.csv) and [cars2](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/05_Merge/Auto_MPG/cars2.csv).

   ### Step 3. Assign each to a variable called cars1 and cars2

In [2]:
cars1 = pd.read_csv('https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/05_Merge/Auto_MPG/cars1.csv')

In [6]:
cars1.head(1)

,mpg,cylinders,displacement,horsepower,weight,acceleration,model,origin,car,Unnamed: 9,Unnamed: 10,Unnamed: 11,Unnamed: 12,Unnamed: 13
0,18.0,8,307,130,3504,12.0,70,1,chevrolet chevelle malibu,NaN,NaN,NaN,NaN,NaN

In [4]:
cars2 = pd.read_csv('https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/05_Merge/Auto_MPG/cars2.csv')

In [7]:
cars2.head(1)

,mpg,cylinders,displacement,horsepower,weight,acceleration,model,origin,car
0,33.0,4,91,53,1795,17.4,76,3,honda civic

### Step 4. Ops it seems our first dataset has some unnamed blank columns, fix cars1

In [8]:
cars1.columns

Index(['mpg', 'cylinders', 'displacement', 'horsepower', 'weight',
       'acceleration', 'model', 'origin', 'car', 'Unnamed: 9', 'Unnamed: 10',
       'Unnamed: 11', 'Unnamed: 12', 'Unnamed: 13'],
      dtype='object')

In [9]:
cars1.drop(['Unnamed: 9', 'Unnamed: 10','Unnamed: 11', 'Unnamed: 12', 
            'Unnamed: 13'], axis=1, inplace=True)

In [10]:
cars1.head(2)

,mpg,cylinders,displacement,horsepower,weight,acceleration,model,origin,car
0,18.0,8,307,130,3504,12.0,70,1,chevrolet chevelle malibu
1,15.0,8,350,165,3693,11.5,70,1,buick skylark 320

### Step 5. What is the number of observations in each dataset?

In [11]:
cars1.shape[0]

198

In [12]:
cars2.shape[0]

200

### Step 6. Join cars1 and cars2 into a single DataFrame called cars

In [13]:
cars1.columns

Index(['mpg', 'cylinders', 'displacement', 'horsepower', 'weight',
       'acceleration', 'model', 'origin', 'car'],
      dtype='object')

In [14]:
cars2.columns

Index(['mpg', 'cylinders', 'displacement', 'horsepower', 'weight',
       'acceleration', 'model', 'origin', 'car'],
      dtype='object')

In [15]:
cars = cars1.append(cars2)

In [16]:
cars.shape

(398, 9)

### Step 7. Ops there is a column missing, called owners. Create a random number Series from 15,000 to 73,000.

In [17]:
import numpy as np

In [32]:
owners = np.random.randint(15000, 73000, size=cars.shape[0])

In [33]:
len(owners)

398

In [35]:
cars['owners'] = owners

### Step 8. Replace the owners column name to price of the car.

In [37]:
cars.rename({'owners':'price'}, axis=1, inplace=True)

In [38]:
cars.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model,origin,car,price
0,18.0,8,307,130,3504,12.0,70,1,chevrolet chevelle malibu,67835
1,15.0,8,350,165,3693,11.5,70,1,buick skylark 320,40009
2,18.0,8,318,150,3436,11.0,70,1,plymouth satellite,48353
3,16.0,8,304,150,3433,12.0,70,1,amc rebel sst,51947
4,17.0,8,302,140,3449,10.5,70,1,ford torino,19773